{'html': '<html>\r\n<head>\r\n<title>Jens Groth: Openings</title>\r\n</head>\r\n<body bgcolor="#ffffff" text="#000000">\r\n<table>\r\n<tr><td><img\r\nsrc="http://www.cs.ucl.ac.uk/staff/J.Groth/JG.JPG"></td><td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n<td><table><tr><td><h1>Jens\r\nGroth</h1></td><td></td><td></td></tr>\r\n<tr><td>Jens Groth<br><a href="http://www.cs.ucl.ac.uk/">Department of Computer Science</a>, UCL&nbsp; &nbsp; &nbsp; <br>Gower Street<br>London WC1E 6BT<br>United Kingdom<p>Office: 6.21a (door phone: 33666) <br>E-mail: <a href="mailto:j.groth@ucl.ac.uk">j.groth@ucl.ac.uk</a> (e-mail best way to reach me) <br>Phone: +44 20 7679 3666<br>Fax: +44 20 7387 1397<br>Skype: jensois<br>Homepage: <a href="http://www.cs.ucl.ac.uk/staff/J.Groth">www.cs.ucl.ac.uk/staff/J.Groth</a></td><td></td></tr></table></tr></table>\r\n\r\n<h2>Research Associates (Post-Docs)</h2>\r\nI am always happy to receive applications from strong candidates.\r\n\r\n<h4>Qualifications</h4> \r\nA strong publication record including top conferences or journals, for instance IACR conferences such as ASIACRYPT, CRYPTO and EUROCRYPT, or other relevant A-ranked conferences such as CCS, Oakland, USENIX, etc. (see <a href="http://103.1.187.206/core/">here</a> for conference rankings).\r\n\r\n<h4>How to apply</h4> \r\nCurrently no openings, but feel free to send me an e-mail to enquire about future oportunities. I prefer not to click on attachments, so instead of sending a CV, please include a link to your Google Scholar profile or DBLP page.\r\n\r\n<h2>PhD students</h2>\r\nI am happy to receive applications from students with an interest in cryptography. Please see below for the type of student I am looking for and how to apply.\r\n\r\n<h4>Qualifications</h4> \r\nBSc or MSc in Mathematics, Computer Science or related discipline with top marks. Applicants from universities in the UK should have marks well above First/Distinction level.\r\n\r\n<p>Good communication skills; especially in written English.\r\n\r\n<h4>Research area</h4>\r\nI am interested in building cryptographic schemes and mathematically proving that they are secure. I have worked on pairing-based cryptography, zero-knowledge proofs, internet voting and mix-nets, signatures, and public-key encryption. My publications can be found on my <a href="http://www.cs.ucl.ac.uk/staff/J.Groth">homepage</a>. You should take a look at a few of them before applying to check that our research interests match. \r\n\r\n<p>If we do not match, maybe some of my colleagues working in other areas of cryptography and information security will be suitable advisors for you. Please look at the members of our <a href="http://sec.cs.ucl.ac.uk/ace_csr/">Academic Centre of Excellence in Cyber Security Research</a> to find a potential advisor that matches your research interests.\r\n\r\n<h4>Funding</h4>\r\nI do not currently have funding for PhD students but if you are a British citizen there are some options we can pursue including departmental funding or a PhD in security science <a href="https://www.ucl.ac.uk/secret/homepage">UCL SECReT</a>.\r\n\r\nIt is hard to get funding for EU and Overseas citizens. If you apply as an Overseas student I expect you to be self-funded including both cost of living and UCL fees for overseas PhD students.\r\n\r\n<h4>E-mail</h4>\r\nYou cannot apply by e-mail, but if you have concrete questions please feel free to send me an e-mail before applying. When you e-mail me please briefly state citizenship, degree, GPA and awarding university in the main body of the e-mail so that I can quickly check that you meet the qualifications listed above. \r\n\r\n<p>I usually do not click on attachments, so please <b>do not attach a CV</b> to your e-mail.\r\n\r\n<h4>How to apply</h4> \r\nApplications can be made through the <a href="http://www.cs.ucl.ac.uk/admissions/phd_programme/applying/">online system</a> specifying Computer Science as the department and \'Jens Groth\' as the supervisor.\r\n\r\n<p>An application should include transcripts from BSc/MSc degrees and other relevant information, e.g., work experience, awards, etc. You will be asked to submit a personal statement, which you can use to describe your academic and personal skills and experience and the reason you are interested in doing a PhD in cryptography.\r\n\r\n\r\n<h2>Visiting PhD students</h2>\r\nIf you are a PhD student elsewhere and want to visit UCL for a few months the same criteria as described above apply. You will have to pay UCL\'s fees for PhD students at a pro-rata rate for the time you are visiting. To apply, use the online form for regular PhD students specifying the duration in your application.\r\n\r\n<h2>MSc Students</h2>\r\nUniversity College London offers an MSc in Information Security. Please go to <a href="http://www.cs.ucl.ac.uk/admissions/msc_isec/">http://www.cs.ucl.ac.uk/teaching/mscisec/</a> for more information and instructions on how to apply.\r\n\r\n<h2>Summer Internships</h2>\r\nUniversity College London does not offer internships.\r\n\r\n\r\n</body>\r\n</html>\r\n',
 'pid': 106,
 'url': 'http://www0.cs.ucl.ac.uk/staff/J.Groth/openings.html'}