{'html': b'George Danezis, B.A, M.A (Cantab), Ph.D, FBCS \r\n\r\nGeorge Danezis'
         b' is a Professor of Security and Privacy Engineering at the Departmen'
         b't of Computer Science of University College London, and Head of the '
         b'Information Security Research Group. He has been working on anonymou'
         b's communications, privacy enhancing technologies (PET), and traffic '
         b'analysis since 2000. He has previously been a researcher for Microso'
         b'ft Research, Cambridge; a visiting fellow at K.U.Leuven (Belgium); a'
         b'nd a research associate at the University of Cambridge (UK), where h'
         b'e also completed his doctoral dissertation under the supervision of '
         b'Prof. R.J. Anderson.\r\n\r\nHis theoretical contributions to the Pri'
         b'vacy Technologies field include the established information theoreti'
         b'c and other probabilistic metrics for anonymity and pioneering the s'
         b'tudy of statistical attacks against anonymity systems. On the practi'
         b'cal side he is one of the lead designers of the anonymous mail syste'
         b'm Mixminion, as well as Minx, Sphinx, Drac and Hornet; he has worked'
         b' on the traffic analysis of deployed protocols such as Tor.\r\n\r\nH'
         b'is current research interests focus around secure communications, hi'
         b'gh-integirty systems to support privacy, smart grid privacy, peer-to'
         b'-peer and social network security, as well as the application of mac'
         b'hine learning techniques to security problems. He has published over'
         b' 70 peer-reviewed scientific papers on these topics in international'
         b' conferences and journals.\r\n\r\nHe was the co-program chair of ACM'
         b' Computer and Communications Security Conference in 2011 and 2012, I'
         b'FCA Financial Cryptography and Data Security in 2011, the Privacy En'
         b'hancing Technologies Workshop in 2005 and 2006. He sits on the PET S'
         b'ymposium board and ACM CCS Steering committee and he regularly serve'
         b's in program committees of leading conferences in the field of priva'
         b'cy and security. He is a fellow of the British Computing Society sin'
         b'ce 2014.\r\n\r\nWeb page: http://www0.cs.ucl.ac.uk/staff/G.Danez'
         b'is/\r\n Full CV: http://www0.cs.ucl.ac.uk/staff/G.Danezis/danezis-'
         b'cv.pdf\r\n',
 'links': [],
 'pid': 2041,
 'url': 'http://www0.cs.ucl.ac.uk/staff/G.Danezis/Danezis-blurb.txt'}