{'html': b'<html>\r\n<head>\r\n<title>Jens Groth: Openings</title>\r\n</head>'
         b'\r\n<body bgcolor="#ffffff" text="#000000">\r\n<table>\r\n<tr><td>'
         b'<img\r\nsrc="http://www.cs.ucl.ac.uk/staff/J.Groth/JG.JPG"></td><t'
         b'd>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n<td><ta'
         b'ble><tr><td><h1>Jens\r\nGroth</h1></td><td></td><td></td></tr>\r\n<t'
         b'r><td>Jens Groth<br><a href="http://www.cs.ucl.ac.uk/">Department of'
         b' Computer Science</a>, UCL&nbsp; &nbsp; &nbsp; <br>Gower Street<br>L'
         b'ondon WC1E 6BT<br>United Kingdom<p>Office: 6.21a (door phone: 33666)'
         b' <br>E-mail: <a href="mailto:j.groth@ucl.ac.uk">j.groth@ucl.ac.uk</a'
         b'> (e-mail best way to reach me) <br>Phone: +44 20 7679 3666<br>Fax: '
         b'+44 20 7387 1397<br>Skype: jensois<br>Homepage: <a href="http://www.'
         b'cs.ucl.ac.uk/staff/J.Groth">www.cs.ucl.ac.uk/staff/J.Groth</a></td><'
         b'td></td></tr></table></tr></table>\r\n\r\n<h2>Research Associates (P'
         b'ost-Docs)</h2>\r\nI am always happy to receive applications from s'
         b'trong candidates.\r\n\r\n<h4>Qualifications</h4> \r\nA strong publ'
         b'ication record including top conferences or journals, for instance I'
         b'ACR conferences such as ASIACRYPT, CRYPTO and EUROCRYPT, or other re'
         b'levant A-ranked conferences such as CCS, Oakland, USENIX, etc. (see '
         b'<a href="http://103.1.187.206/core/">here</a> for conference ranking'
         b's).\r\n\r\n<h4>How to apply</h4> \r\nCurrently no openings, but fe'
         b'el free to send me an e-mail to enquire about future oportunities. I'
         b' prefer not to click on attachments, so instead of sending a CV, ple'
         b'ase include a link to your Google Scholar profile or DBLP page.\r'
         b'\n\r\n<h2>PhD students</h2>\r\nI am happy to receive applications'
         b' from students with an interest in cryptography. Please see below fo'
         b'r the type of student I am looking for and how to apply.\r\n\r\n<h4>'
         b'Qualifications</h4> \r\nBSc or MSc in Mathematics, Computer Scienc'
         b'e or related discipline with top marks. Applicants from universities'
         b' in the UK should have marks well above First/Distinction level.'
         b'\r\n\r\n<p>Good communication skills; especially in written English.'
         b'\r\n\r\n<h4>Research area</h4>\r\nI am interested in building cryp'
         b'tographic schemes and mathematically proving that they are secure. I'
         b' have worked on pairing-based cryptography, zero-knowledge proofs, i'
         b'nternet voting and mix-nets, signatures, and public-key encryption. '
         b'My publications can be found on my <a href="http://www.cs.ucl.ac.uk/'
         b'staff/J.Groth">homepage</a>. You should take a look at a few of them'
         b' before applying to check that our research interests match. \r\n\r'
         b'\n<p>If we do not match, maybe some of my colleagues working in o'
         b'ther areas of cryptography and information security will be suitable'
         b' advisors for you. Please look at the members of our <a href="http:/'
         b'/sec.cs.ucl.ac.uk/ace_csr/">Academic Centre of Excellence in Cyber S'
         b'ecurity Research</a> to find a potential advisor that matches your r'
         b'esearch interests.\r\n\r\n<h4>Funding</h4>\r\nI do not currently h'
         b'ave funding for PhD students but if you are a British citizen there '
         b'are some options we can pursue including departmental funding or a P'
         b'hD in security science <a href="https://www.ucl.ac.uk/secret/homepag'
         b'e">UCL SECReT</a>.\r\n\r\nIt is hard to get funding for EU and Overs'
         b'eas citizens. If you apply as an Overseas student I expect you to be'
         b' self-funded including both cost of living and UCL fees for overseas'
         b' PhD students.\r\n\r\n<h4>E-mail</h4>\r\nYou cannot apply by e-mai'
         b'l, but if you have concrete questions please feel free to send me an'
         b' e-mail before applying. When you e-mail me please briefly state cit'
         b'izenship, degree, GPA and awarding university in the main body of th'
         b'e e-mail so that I can quickly check that you meet the qualification'
         b's listed above. \r\n\r\n<p>I usually do not click on attachments, so'
         b' please <b>do not attach a CV</b> to your e-mail.\r\n\r\n<h4>How to '
         b'apply</h4> \r\nApplications can be made through the <a href="http:'
         b'//www.cs.ucl.ac.uk/admissions/phd_programme/applying/">online system'
         b"</a> specifying Computer Science as the department and 'Jens Groth' "
         b'as the supervisor.\r\n\r\n<p>An application should include transcrip'
         b'ts from BSc/MSc degrees and other relevant information, e.g., work e'
         b'xperience, awards, etc. You will be asked to submit a personal state'
         b'ment, which you can use to describe your academic and personal skill'
         b's and experience and the reason you are interested in doing a PhD in'
         b' cryptography.\r\n\r\n\r\n<h2>Visiting PhD students</h2>\r\nIf you a'
         b're a PhD student elsewhere and want to visit UCL for a few months th'
         b"e same criteria as described above apply. You will have to pay UCL's"
         b' fees for PhD students at a pro-rata rate for the time you are visit'
         b'ing. To apply, use the online form for regular PhD students specifyi'
         b'ng the duration in your application.\r\n\r\n<h2>MSc Students</h2'
         b'>\r\nUniversity College London offers an MSc in Information Securi'
         b'ty. Please go to <a href="http://www.cs.ucl.ac.uk/admissions/msc_ise'
         b'c/">http://www.cs.ucl.ac.uk/teaching/mscisec/</a> for more informati'
         b'on and instructions on how to apply.\r\n\r\n<h2>Summer Internships</'
         b'h2>\r\nUniversity College London does not offer internships.\r\n'
         b'\r\n\r\n</body>\r\n</html>\r\n',
 'links': [284, 2166, 288, 2167, 195],
 'pid': 2165,
 'url': 'http://www0.cs.ucl.ac.uk/staff/J.Groth/openings.html'}