{'html': b'<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">\r\n<html>\r\n<body bg'
         b'color=ffffff text=000000>\r\n  <head>\r\n    <title>Trust Domains</t'
         b'itle>\r\n  </head>\r\n\r\n<hr>\r\n<p>\r\n<b>Trust Domains</b>\r'
         b'\n\r\n<p>\r\n\r\nEnsuring flows of information to the right people '
         b'over multiple collaborating organisations is \r\nbecoming increasi'
         b'ngly important for both business and government. There are, however,'
         b' trade-offs \r\nbetween the productivity and functional gains from'
         b' sharing information, on the one hand, and the \r\nrisks of leakag'
         b'e and opening up IT systems, on the other. Recent developments in tr'
         b'usted computing \r\nand virtualization can address these trade off'
         b's in a flexible manner, as they allow for the \r\ncreation of poli'
         b'cy controlled IT systems with configurable security properties. Coll'
         b'aborative, \r\nsecure sharing solutions can be realized through th'
         b"e creation of dynamic 'Trust Domains' --- a \r\nnotion that we pro"
         b'pose to explore at and between all levels of the policy-service-infr'
         b'astructure \r\nstack --- that enforce information flow and configu'
         b'ration policies.\r\n\r\n<p>\r\n\r\nWe propose a customer-driven proj'
         b'ect that starts out from examples of information sharing within '
         b'\r\npolice forces and agencies they work with. Based on a practica'
         b'l understanding of the required flows \r\nand policies, we will de'
         b'velop an abstract framework for qualifying types of and flows of inf'
         b'ormation \r\nand a corresponding model of the associated risks. Th'
         b'is allows process owners to describe their \r\nrequirements and co'
         b'ncerns. We will research how to qualify and map information flows to'
         b' Trust Domain \r\nconfigurations, derive guidelines and templates '
         b'for supporting solution architects in building IT \r\nservices, an'
         b'd extend our set of analytics and modelling tools to help stakeholde'
         b'rs gain an understanding \r\nof the risks associated with informat'
         b'ion flows and enforcement mechanisms.There are business opportunitie'
         b's \r\nfor creating and operating new e-services with enhanced trus'
         b't and security properties based on new \r\nmethodologies and tools'
         b'ets. The framework we suggest takes a business driven approach to ri'
         b'sk, trust \r\nand security and covers aspects of process and syste'
         b'm analysis, design, configuration, security policy, \r\nhuman role'
         b's, and operational management.\r\n\r\n<p>\r\n\r\nWe create a value p'
         b'roposition by having the models, tools and methodologies that allows'
         b' us to bridge the \r\ncurrent gap between business level risk and '
         b'system configuration and policy design. Hence mapping service \r\n'
         b'needs onto trusted platforms, domains, and infrastructureThe project'
         b' complements and expands ongoing, \r\nTSB-funded work on trust eco'
         b'nomics as well as on complexity, risk, and resilience management pio'
         b"neered \r\nand exploited by HP's UK Enterprise Services. Both HP E"
         b'nterprise Services and HP Labs, Bristol believe \r\nthat bridging '
         b'high-level incentive models and systems design for trust domains wou'
         b'ld be a unique global \r\ndifferentiator, not only aligned with US'
         b"-NITRD 'game-changing' themes, but ahead of them in suggesting \r"
         b'\nan integrated approach. The academic components of this project'
         b' will contribute the following developments \r\nin support of this'
         b' programme: \r\n<p>\r\n<ul> \r\n<li> The concept of Trust Domain, '
         b'at and between the various levels of the \r\nsocio-technical syste'
         b'm stack (policy-service-infrastructure); \r\n<li> Mathematical sys'
         b'tems modelling \r\ntechnologies to support tools and methodologies'
         b' for reasoning about the properties, dynamics,\r\n and application'
         b's of the Trust Domain concept; \r\n<li> A thorough taxonomy of tec'
         b'hnical, design, and architectural \r\nproperties which give rise t'
         b'o different trust characteristics in deployed services; \r\n<li> M'
         b'odelling the quality of trust and expectations among components, to '
         b'the extent of being able to make a \r\nmeaningful comparison of so'
         b'lutions based on different architectural paradigms, within a given c'
         b'ontext.\r\n</ul>\r\n<p>\r\nTargeted market: intra-corporate and in'
         b"tra-governmental data centres and 'clouds' whose stringent informati"
         b"on \r\nflow control requirements cannot be met by today's provider"
         b's.\r\n<p>\r\n<hr>\r\n\r\n</body>\r\n</html>\r\n',
 'links': [],
 'pid': 2656,
 'url': 'http://www0.cs.ucl.ac.uk/staff/D.Pym/TD.html'}