{'html': b'@article {Steptoe2012,\n\tpages            = "406-422",\n\tauthor   '
         b'        = "William Steptoe and Jean-Marie Normand and Oyewole Oyekoy'
         b'a and Fabrizio Pece and Elias Giannopoulos and Franco Tecchia and An'
         b'thony Steed and Tim Weyrich and Jan Kautz and Mel Slater",\n\tyear'
         b'             = "2012",\n\ttitle            = "Acting Rehearsal in '
         b'Collaborative Multimodal Mixed Reality Environments",\n\tmonth    '
         b'        = "FALL",\n\tjournal          = "PRESENCE-TELEOPERATORS AN'
         b'D VIRTUAL ENVIRONMENTS",\n\tvolume           = "21",\n\tnumber      '
         b'     = "4",\n\tabstract         = "This paper presents the use of '
         b'our multimodal mixed reality telecommunication system to support rem'
         b'ote acting rehearsal. The rehearsals involved two actors, located in'
         b' London and Barcelona, and a director in another location in London.'
         b' This triadic audiovisual telecommunication was performed in a spati'
         b'al and multimodal collaborative mixed reality environment based on t'
         b'he &ldquo;destination-visitor&rdquo; paradigm, which we define and p'
         b'ut into use. We detail our heterogeneous system architecture, which '
         b'spans the three distributed and technologically asymmetric sites, an'
         b'd features a range of capture, display, and transmission technologie'
         b's. The actors&rsquo; and director&rsquo;s experience of rehearsing a'
         b' scene via the system are then discussed, exploring successes and fa'
         b'ilures of this heterogeneous form of telecollaboration. Overall, the'
         b' common spatial frame of reference presented by the system to all pa'
         b'rties was highly conducive to theatrical acting and directing, allow'
         b'ing blocking, gross gesture, and unambiguous instruction to be issue'
         b'd. The relative inexpressivity of the actors&rsquo; embodiments was '
         b'identified as the central limitation of the telecommunication, meani'
         b'ng that moments relying on performing and reacting to consequential '
         b'facial expression and subtle gesture were less successful.",\n\tis'
         b'sn             = "1054-7460"}\n',
 'links': [],
 'pid': 2712,
 'url': 'http://www0.cs.ucl.ac.uk/staff/F.Pece/publications/bibtex/acting_presence2012.bib'}