{'html': '\n<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">\n<html>\n  <head>\n    <title>COMP M074/GV14 &ndash; Course Work</title>\n    <meta http-equiv="content-type" content="text/html;charset=iso-8859-1" />\n    <meta name="robots" content="noindex,nofollow,noarchive">\n    <link rel="stylesheet" href="style.css" type="text/css" />\n    <script type="text/javascript" src="hiddenemail.js"></script>\n  </head>\n\n  <body>\n    <!-- <h1>COMP M074/GV14 &ndash; Course Work</h1> -->\n    <h1>Advanced Modelling, Rendering and Animation</h1>\n    <h2>Course Work</h2>\n\n      <a href="index.php">Home</a> | <a href="syllabus.php">Syllabus</a> | Course Work | <a href="assessment.php">Assessment</a>      <p/>\n\n<table width="100%" cellpadding=6 cellspacing=1 bgcolor="#a0a0b0" >\n<tr bgcolor="#e8e8f0">\n<th align=left><font size=\\"+2\\">Path Tracing assignment reading list</font></th>\n</tr>\n<tr bgcolor="#ffffff"> <td> \n<p>\n\n<p align="justify">The following are pretty good suggestions of what to read to get to grips writing a Monte-Carlo path tracer. <a href="#[8]">[8]</a> has more in-depth material on how to perform the direct lighting computations, and <a href="#[9]">[9]</a> is useful if you have a good idea of the overall algorithm but need to look up specific formulas.</p>\n\n<p align="justify"><u>Matt Pharr\x92s</u> suggestions on reading to understand how to write a path\ntracer (edited):</p>\n\n<p align="justify">I think that the best way to approach all this is starting with more recent papers/notes, rather than the originals. With the passage of time comes more clarity/better ways of explaining things and it allows one to get the right foundations down before going back to the papers where it was all being first worked out.</p>\n\n<p align="justify">That said, I\'d strongly suggest that you start with the course notes from the Advanced Mote Carlo course from SIGGRAPH 2001 <a href="#[1]">[1]</a>. I\'d also suggest that you work up to path tracing and bidirectional path tracing by way of first focusing on the so-called direct lighting problem - computing reflected light at a point on a surface with a complex BRDF due to illumination from an area light source - as a way to build up intuition and experience.</p>\n\n<p align="justify">That said, from those SIGGRAPH notes, the chapters by Peter Shirley and Jim Arvo on the fundamentals of Monte Carlo integration and techniques for sampling BRDFs and light sources are good to understand as well.</p>\n\n<p align="justify">Every hour you spent getting a handle on the basics of Monte Carlo will pay off many times as you go forward, since it will save you a lot of time adding and removing factors of PI and cos(theta) from your implementation until you stumble upon the right formulation.</p>\n\n<p align="justify">Peter Shirley et al\'s paper on sampling area light source is also quite good and worth working through carefully <a href="#[5]">[5]</a>.</p>\n\n<p align="justify">Having gone through that, read Arvo\'s write-up of multiple importance sampling in the SIGGRAPH course notes and Chapter 9 of Veach\'s PhD thesis <a href="#[6]">[6]</a>.</p>\n\n<p align="justify">Make sure you understand how to apply multiple importance sampling to direct lighting and why it works well.</p>\n\n<p align="justify">Then, onward to path tracing which is the same thing as Monte Carlo path tracing. Check out Hanrahan\'s section in those SIGGRAPH course notes, and Veach\'s path integral formulation of the rendering equation (in Chapter 8 of his thesis).</p>\n\n<p align="justify">The rendering equation is often presented in a form that tempts one to solve it recursively; the path integral way of thinking about what the rendering equation says is a lot more powerful.</p>\n\n<p align="justify">Then go back and read Kajiya\'s paper <a href="#[3]">[3]</a>, though keep in mind his terminology and formulation of the rendering equation are different than what is in use today.</p>\n\n<p align="justify">If you understand the path integral way of thinking about the rendering equation, basic bidirectional path tracing is a relatively small generalization. Read the corresponding chapter of Veach\'s thesis as well as Eric Lafortune\'s papers/PhD thesis <a href="#[4]">[4]</a>.</p>\n\n<p align="justify">Henrik Wann Jensen\'s papers on photon mapping <a href="#[2]">[2]</a> are a good way to understand that technique; his recent book also covers the topic. You should also read\nGreg Ward\'s papers on irradiance caching <a href="#[7]">[7]</a>.</p>\n<br><br>\n<p align="justify"><u>References</u></p>\n\n<p align="justify"><a name="[1]">[1]</a> James Arvo, Marcos Fajardo, Pat Hanrahan, Henrik W. Jensen, Don P. Mitchell, Matt Pharr, and Peter S. Shirley, \n<a href="mc-course_notes__sig91.pdf">State of the Art in Monte\nCarlo Ray Tracing for Realistic Image Synthesis</a>, 2001.</p>\n\n<p align="justify"><a name="[2]">[2]</a> Henrik W. Jensen, <a href="jensen__importance_driven_path_tracing__1995.pdf">Importance Driven Path Tracing using the Photon\nMap</a>, <i>Proc.6th Eurographics Workshop on Rendering</i>, 1995, pp. 326-335.</p>\n\n<p align="justify"><a name="[3]">[3]</a> James T. Kajiya, <a href="Kajiya_J_T__The_Rendering_Equation__SIGGRAPH86.pdf">The Rendering Equation</a>, <i>Computer\nGraphics</i>, 20(4), 1986, pp. 143-150.</p>\n\n<p align="justify"><a name="[4]">[4]</a> Eric P. F. Lafortune, <a href="LaFortune_E_P__Mathematical_Models_And_Monte_Carlo_Algorithms_For_Physically_Based_Rendering__PhDthesis.pdf">Mathematical Models and Monte Carlo\nAlgorithms for Physically Based Rendering</a>, PhD thesis, Katholieke Universiteit Leuven, February 1996.</p>\n\n<p align="justify"><a name="[5]">[5]</a> Peter Shirley, Changyaw Wang, and Kurt Zimmerman, \n<a href="shirley__MC_techniques_for_direct_lighting__tog96.pdf">Monte Carlo Techniques for Direct Lighting Calculations</a>, <i>ACM Transactions on Graphics</i>, 15(1), 1996, pp. 1-36.</p>\n\n<p align="justify"><a name="[6]">[6]</a> Eric Veach, <a href="veach__thesis.pdf">Robust Monte Carlo Methods for Light Transport Simulation</a>, PhD thesis, Stanford University, December 1997</p>\n\n<p align="justify"><a name="[7]">[7]</a> Gregory J. Ward and Paul S. Heckbert, <a href="Ward_G_J__Irradiance_Gradients__1992.pdf">Irradiance Gradients</a>, <i>Proc.3rd Eurographics Workshop on Rendering</i>, May 1992, pp. 85-98.</p>\n\n<p align="justify"><a name="[8]">[8]</a> Changyaw Wang, <a href="wang__the_direct_lighting_computation_in_GI__phd.pdf">The Direct Lighting Computation in Global Illumination</a>, Indiana University, February 1994.</p>\n\n<p align="justify"><a name="[9]">[9]</a> Dutre, Philip, <a href="TotalCompendium.pdf">Global \nIllumination Compendium</a>, Katholieke Universiteit Leuven, September 2003.</p>\n\n</p>\n</tr>\n</table>\n\n    <p/>\n    <address><script type="text/javascript">hiddenemail(\'cs.ucl.ac.uk\',\'t.weyrich\')</script>\n      <noscript>enable java script to see my email address</noscript></address>\n  </body>\n</html>\n',
 'pid': 291,
 'url': 'http://web4.cs.ucl.ac.uk/teaching/4074/archive/2012/cw3/readinglist/readinglist.php'}