{'html': b'<?xml version="1.0" encoding="UTF-8"?><rss version="2.0"\n\txmlns:'
         b'content="http://purl.org/rss/1.0/modules/content/"\n\txmlns:dc="ht'
         b'tp://purl.org/dc/elements/1.1/"\n\txmlns:atom="http://www.w3.org/2'
         b'005/Atom"\n\txmlns:sy="http://purl.org/rss/1.0/modules/syndication'
         b'/"\n\t\n\t>\n<channel>\n\t<title>Comments on: Filtering By Trust</t'
         b'itle>\n\t<atom:link href="http://mobblog.cs.ucl.ac.uk/2008/02/28/f'
         b'iltering-by-trust/feed/" rel="self" type="application/rss+xml" /'
         b'>\n\t<link>http://mobblog.cs.ucl.ac.uk/2008/02/28/filtering-by-tru'
         b'st/</link>\n\t<description>Research:  Smart Cities &#38; Data Mini'
         b'ng &#38; Social Media</description>\n\t<lastBuildDate>Mon, 28 Jun '
         b'2010 22:46:44 +0000</lastBuildDate>\n\t\t<sy:updatePeriod>hourly</s'
         b'y:updatePeriod>\n\t\t<sy:updateFrequency>1</sy:updateFrequency>'
         b'\n\t<generator>http://wordpress.org/?v=3.8.1</generator>\n\t<ite'
         b'm>\n\t\t<title>By: MobBlog &#187; Blog Archive &#187; Strange Bugs<'
         b'/title>\n\t\t<link>http://mobblog.cs.ucl.ac.uk/2008/02/28/filtering'
         b'-by-trust/#comment-2204</link>\n\t\t<dc:creator><![CDATA[MobBlog &#'
         b'187; Blog Archive &#187; Strange Bugs]]></dc:creator>\n\t\t<pubDate'
         b'>Thu, 15 May 2008 17:12:09 +0000</pubDate>\n\t\t<guid isPermaLink="'
         b'false">http://mobblog.cs.ucl.ac.uk/2008/02/28/filtering-by-trust/#co'
         b'mment-2204</guid>\n\t\t<description><![CDATA[[...] user&#8217;s mea'
         b'n from each rating, do an average- weighting each rating by similari'
         b'ty (or trust!)- and then add your own mean to that. So neighbours wh'
         b'o have not rated the item in question do not [...]]]></descripti'
         b'on>\n\t\t<content:encoded><![CDATA[<p>[...] user&#8217;s mean from '
         b'each rating, do an average- weighting each rating by similarity (or '
         b'trust!)- and then add your own mean to that. So neighbours who have '
         b'not rated the item in question do not [...]</p>\n]]></content:enc'
         b'oded>\n\t</item>\n\t<item>\n\t\t<title>By: MobBlog &#187; Blog Arch'
         b'ive &#187; Online Applications</title>\n\t\t<link>http://mobblog.cs'
         b'.ucl.ac.uk/2008/02/28/filtering-by-trust/#comment-2051</link>\n\t\t'
         b'<dc:creator><![CDATA[MobBlog &#187; Blog Archive &#187; Online Appli'
         b'cations]]></dc:creator>\n\t\t<pubDate>Tue, 15 Apr 2008 11:12:05 +00'
         b'00</pubDate>\n\t\t<guid isPermaLink="false">http://mobblog.cs.ucl.a'
         b'c.uk/2008/02/28/filtering-by-trust/#comment-2051</guid>\n\t\t<descr'
         b'iption><![CDATA[[...] are a number of names appearing that merge rec'
         b'ommendations with social interactions - away from neat algorithm'
         b's\xc2\xa0 and towards human-driven reviews and recommendations. Na'
         b'mes like Reevoo, Boxedup, LouderVoice, [...]]]></description>\n\t\t'
         b'<content:encoded><![CDATA[<p>[...] are a number of names appearing t'
         b'hat merge recommendations with social interactions &#8211; away from'
         b' neat algorithms\xc2\xa0 and towards human-driven reviews and reco'
         b'mmendations. Names like Reevoo, Boxedup, LouderVoice, [...]</p>\n'
         b']]></content:encoded>\n\t</item>\n\t<item>\n\t\t<title>By: Audu'
         b'n J\xc3\xb8sang</title>\n\t\t<link>http://mobblog.cs.ucl.ac.uk/20'
         b'08/02/28/filtering-by-trust/#comment-2030</link>\n\t\t<dc:creator><'
         b'![CDATA[Audun J\xc3\xb8sang]]></dc:creator>\n\t\t<pubDate>Wed, 09'
         b' Apr 2008 10:59:57 +0000</pubDate>\n\t\t<guid isPermaLink="false">h'
         b'ttp://mobblog.cs.ucl.ac.uk/2008/02/28/filtering-by-trust/#comment-20'
         b'30</guid>\n\t\t<description><![CDATA[Two main interpretations are t'
         b'o view trust as the perceived reliability of something or somebody, '
         b'called \xe2\x80\x9creliability trust\xe2\x80\x9d, and to view trus'
         b't as a decision to enter into a situation of dependence, called '
         b'\xe2\x80\x9cdecision trust\xe2\x80\x9d. Both reliability trust and'
         b' decision trust reflect a positive belief about something on\r\nwh'
         b'ich trustor depends for his welfare. Reliability trust is most natur'
         b'ally measured as a discrete or continuous degree of reliability, whe'
         b'reas decision trust is most naturally measured in terms of a binary '
         b'decision. While most trust and reputation models assume reliability '
         b'trust, decision trust can also modelled. Systems based on decision t'
         b'rust models should be considered as decision making tools. \r\n\r\nT'
         b'he difficulty of capturing the notion of trust in formal models in a'
         b' meaningful way has led some economists to reject it as a computatio'
         b'nal concept. The strongest expression for this view has been given b'
         b'y Williamson (Calculativeness, Trust and Economic Organization. Jour'
         b'nal of Law and Economics, 36:453-486, April 1993.) who argues that t'
         b'he notion of trust should be avoided when modelling economic interac'
         b'tions, because it adds nothing new, and that well studied notions su'
         b'ch as reliability, utility and risk are adequate and sufficient for '
         b'that purpose. Personal trust is the only type of trust that can be m'
         b'eaningful for describing interactions, according to Williamson. He a'
         b'rgues that personal trust applies to emotional and personal interact'
         b'ions such as love relationships where mutual performance is not alwa'
         b'ys monitored and where failures are forgiven rather than sanctioned.'
         b' In that sense, traditional computational models would be inadequate'
         b' e.g. because of insuffcient data and inadequate sanctioning, but al'
         b'so because it would be detrimental to the relationships if the invol'
         b'ved parties were to take a computational approach. Non-computation m'
         b'odels for trust can be meaningful for studying such relationships ac'
         b'cording to Williamson, but developing such models should be done wit'
         b'hin the domains of sociology and psychology, rather than in economy.'
         b'\r\n\r\nIn the light of Williamson&#039;s view on modelling trust it'
         b' becomes important to judge the purpose and merit of online trust ma'
         b'nagement itself. Can trust management add anything new and valuable '
         b'to the Internet technology and economy? The answer, in our opinion, '
         b'is definitely yes. The value of trust management lies in the archite'
         b'ctures and mechanisms for collecting trust relevant information, for'
         b' efficient, reliable and secure processing, for distribution of deri'
         b'ved trust and reputation scores, and for taking this information int'
         b'o account when navigating the Internet and making decisions about on'
         b'line activities and transactions. Economic models for risk taking an'
         b'd decision making are abstract and do not address how to build trust'
         b' networks and reputation systems. Trust management specifically addr'
         b'esses how to build such systems, and can in addition include aspects'
         b' of economic modelling whenever relevant and useful.\r\n\r\nIt can b'
         b'e noted that the traditional cues of trust and reputation that we ar'
         b'e used to observe and depend on in the physical world are missing in'
         b' online environments. Electronic substitutes are therefore needed wh'
         b'en designing online trust and reputation\r\nsystems. Furthermore, '
         b'communicating and sharing information related to trust and reputatio'
         b'n is relatively difficult, and normally constrained to local communi'
         b'ties in the physical world, whereas IT systems combined with the Int'
         b'ernet can be leveraged to design\r\nextremely efficient systems fo'
         b'r exchanging and collecting such information on a global scale.]]></'
         b'description>\n\t\t<content:encoded><![CDATA[<p>Two main interpretat'
         b'ions are to view trust as the perceived reliability of something or '
         b'somebody, called \xe2\x80\x9creliability trust\xe2\x80\x9d, and to'
         b' view trust as a decision to enter into a situation of dependence, c'
         b'alled \xe2\x80\x9cdecision trust\xe2\x80\x9d. Both reliability tru'
         b'st and decision trust reflect a positive belief about something on<b'
         b'r />\nwhich trustor depends for his welfare. Reliability trust is'
         b' most naturally measured as a discrete or continuous degree of relia'
         b'bility, whereas decision trust is most naturally measured in terms o'
         b'f a binary decision. While most trust and reputation models assume r'
         b'eliability trust, decision trust can also modelled. Systems based on'
         b' decision trust models should be considered as decision making tools'
         b'. </p>\n<p>The difficulty of capturing the notion of trust in for'
         b'mal models in a meaningful way has led some economists to reject it '
         b'as a computational concept. The strongest expression for this view h'
         b'as been given by Williamson (Calculativeness, Trust and Economic Org'
         b'anization. Journal of Law and Economics, 36:453-486, April 1993.) wh'
         b'o argues that the notion of trust should be avoided when modelling e'
         b'conomic interactions, because it adds nothing new, and that well stu'
         b'died notions such as reliability, utility and risk are adequate and '
         b'sufficient for that purpose. Personal trust is the only type of trus'
         b't that can be meaningful for describing interactions, according to W'
         b'illiamson. He argues that personal trust applies to emotional and pe'
         b'rsonal interactions such as love relationships where mutual performa'
         b'nce is not always monitored and where failures are forgiven rather t'
         b'han sanctioned. In that sense, traditional computational models woul'
         b'd be inadequate e.g. because of insuffcient data and inadequate sanc'
         b'tioning, but also because it would be detrimental to the relationshi'
         b'ps if the involved parties were to take a computational approach. No'
         b'n-computation models for trust can be meaningful for studying such r'
         b'elationships according to Williamson, but developing such models sho'
         b'uld be done within the domains of sociology and psychology, rather t'
         b'han in economy.</p>\n<p>In the light of Williamson&#8217;s view o'
         b'n modelling trust it becomes important to judge the purpose and meri'
         b't of online trust management itself. Can trust management add anythi'
         b'ng new and valuable to the Internet technology and economy? The answ'
         b'er, in our opinion, is definitely yes. The value of trust management'
         b' lies in the architectures and mechanisms for collecting trust relev'
         b'ant information, for efficient, reliable and secure processing, for '
         b'distribution of derived trust and reputation scores, and for taking '
         b'this information into account when navigating the Internet and makin'
         b'g decisions about online activities and transactions. Economic model'
         b's for risk taking and decision making are abstract and do not addres'
         b's how to build trust networks and reputation systems. Trust manageme'
         b'nt specifically addresses how to build such systems, and can in addi'
         b'tion include aspects of economic modelling whenever relevant and use'
         b'ful.</p>\n<p>It can be noted that the traditional cues of trust a'
         b'nd reputation that we are used to observe and depend on in the physi'
         b'cal world are missing in online environments. Electronic substitutes'
         b' are therefore needed when designing online trust and reputation<br '
         b'/>\nsystems. Furthermore, communicating and sharing information r'
         b'elated to trust and reputation is relatively difficult, and normally'
         b' constrained to local communities in the physical world, whereas IT '
         b'systems combined with the Internet can be leveraged to design<br'
         b' />\nextremely efficient systems for exchanging and collecting su'
         b'ch information on a global scale.</p>\n]]></content:encoded>\n\t</i'
         b'tem>\n</channel>\n</rss>\n',
 'links': [],
 'pid': 3175,
 'url': 'http://mobblog.cs.ucl.ac.uk/2008/02/28/filtering-by-trust/feed/'}