{'html': '<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">\r<html>\r<head>\r<title>e s c a p e</title>\r<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">\r<meta name="description" content="esc-design, interaction design for dynamic interactive environments, 7c Sunderland Terrace, London W2 5PA, UK">\r<meta name="keywords" content=" escape design, esc design, architecture, design, interaction, dynamic interactive environments, performance, performativity, Mixed Reality, Augmented Reality, games, playful interaction, Mette Ramsgard Thomsen, Jesper Mortensen, bartlett, ucl, university of brighton, brighton, London">\r<script language="JavaScript" type="text/JavaScript">\r<!--\r\rfunction MM_reloadPage(init) {  //reloads the window if Nav4 resized\r  if (init==true) with (navigator) {if ((appName=="Netscape")&&(parseInt(appVersion)==4)) {\r    document.MM_pgW=innerWidth; document.MM_pgH=innerHeight; onresize=MM_reloadPage; }}\r  else if (innerWidth!=document.MM_pgW || innerHeight!=document.MM_pgH) location.reload();\r}\rMM_reloadPage(true);\r//-->\r\r<!--\r/*********************************************************\r             GateKeeper v2.3 - by Joe Barta\r            http://www.pagetutor.com/keeper/\r     Permission is granted to freely use this script.\r**********************************************************/\r\rfunction GateKeeper() {\r   var password = prompt("Password required:", "");\r   if (password) { this.location.href = password + ".html"; }}\r\r//-->\r\r\r   \r</script>\r<link href="text.css" rel="stylesheet" type="text/css">\r</head>\r\r<body bgcolor="999999" background="images/backgroundimage.jpg" text="#FFFFFF">\r<div id="Layer1" style="position:absolute; left:0px; top:188px; width:1300px; height:44px; z-index:1"><img src="images/titlebar.gif" width="1300" height="44" border="0" usemap="#Map"> \r  <map name="Map">\r    <area shape="rect" coords="430,15,493,37" href="profile.html">\r    <area shape="rect" coords="545,16,625,36" href="projects.html">\r    <area shape="rect" coords="671,17,746,36" href="people.html">\r    <area shape="rect" coords="786,16,880,38" href="contacts.html">\r    <area shape="rect" coords="30,1,272,38" href="index.html">\r  </map>\r</div>\r<div id="Layer2" style="position:absolute; left:430px; top:270; width:450; height:850; z-index:2">\r  <h1>Behaving technologies</h1>\r  <div class=Section1> \r    <div class=Section1> \r      <p>Embodied learning and the exploration of agency and autonomy in environments \r        that merge digital and physical experiences are replacing the technology \r        led concerns of user control and interaction transparency. A new digital \r        practice is emerging exploring the notion of a <i>behaving technology</i>, \r        hybridising the engaged agency of the user with the potential presence \r        of a parallel digital realm. Behaving technologies is the forging of a \r        dynamic and evolving relationship between user and environment. It is \r        the thinking of a performed relationship between the embodied presence \r        of its user and a dynamic and intelligent interactive environment. Here, \r        behaviour is what takes place on either side of the interface, an enacted \r        topology established through playful probing and a mutual process of learning \r        and adaptation. </p>\r      <p>This project suggests that the performative properties of space are central \r        to conceiving of spatial experience in interactive environments. Here, \r        performativity is a key concept not only in the thinking of the interactive \r        system and its generative logics, but also in the imagining of the user\'s \r        role and the resulting spatiality of her experience. Addressing an audience \r        from architecture and computer science perspectives, as well as from art, \r        design and dance choreography, this research has consequences for extending \r        the thinking of space as well as for the constructing of new interactive \r        paradigms by which we can embed the consciousness of digital experiences \r        alongside our embodied experiences of the everyday. Questioning the role \r        of technology and the means of user engagement, this research reflects \r        on the possibility of new technology to effect a new sense of agency defining \r        behaviour on both sides of the interface.</p>\r      <p>The project addresses four arising research themes:</p>\r      <p><i>Shaping behaviour, forming the interface <br>\r        </i>Behaving technologies relies on the making of embodied interfaces<i> \r        </i>allowing the user to explore an extended sense of agency merging digital \r        and physical experiences. How can the interface be seen as an open framework \r        for exploration and playful interaction?</p>\r      <p><i>Digital agency<br>\r        </i>As the digital <i>learns </i>to respond to the actions of the user, \r        it attains its own dynamic properties reflecting but also departing from \r        the agency of the user. What is the nature of this shared behaviour of \r        mutual affects? </p>\r      <p><i>Cultural framing<br>\r        </i>Placing behaving technologies within an architectural context opens \r        up for questioning both site and program. How does the spatial experience \r        of the interactive environment intersect and merge with the social and \r        cultural practices of its siting? </p>\r      <p><i>Questioning performativity</i><br>\r        This research probes the forming of a performed space of emerging behaviours. \r        How can the thinking of space become affected by the indeterminacy of \r        interaction? How can conceiving the user as performer challenge the role \r        of technology?</p>\r      <p>&nbsp;</p>\r      <h2 class=Style2>Research context</h2>\r      <p class=Style1>The concept of a new discipline formed around the thinking \r        of behaving technologies was coined by artist and robotisist Simon Penny \r        in his talk <i>After Interdisciplinarity: New Pedagogy, New Identities \r        </i><span\rstyle=\'font-style:normal\'>at the International Symposium for Electronic Arts (ISEA), \r        2004. Merging ideas of autonomous systems with embodied interfaces, </span><i>behaving \r        technologies </i><span style=\'font-style:normal\'>is an emergent field \r        combining research from the fields of Digital Arts, Robotics, Telematics, \r        Virtual Environments, Human Computer Interaction and Artificial Intelligence. \r        Learning from the contemporary thinking of cultural theorists such as \r        Katherine Hayles and Paul Dourish as well as practitioners such as Joseph \r        Weizenbaum, Craig Reynolds, Rodney Brooks and Myron Krueger, behaving \r        technologies aim to establish a dynamic relationship between user and \r        system. Rather than conceiving the interactive environment as a fixed \r        place of user optimisation, behaving technologies reiterate the possibility \r        of presence, redefining and re-constructing the user\'s role in a reality \r        which mixes, joins and grafts physical and digital experiences. </span></p>\r      <p><span lang=EN-US>Locating the question of behaving technologies within \r        an architectural tradition of conceiving and designing space, this project \r        examines the imagining of space as an enacted condition, coming into being \r        through the actions and interactions of its user. Learning from theoreticians \r        such as Elizabeth Grosz and Sanford Kwinter, the project explores the \r        thinking of an <i>event space of interaction</i></span><span lang=EN-US>, \r        a fluvial condition whose dimensions and modalities are essentially performative. \r        These dynamic concepts of space are informing a contemporary debate on \r        digital architecture. The emergence of a digital praxis incorporating \r        concepts of change and duration into the design process was recently framed \r        in Frederic Migayrou\'s exhibition <i>Non Standard Architecture </i></span><span lang=EN-US>at \r        the Pompidou Centre, December 2003, as well as the Mark Goulthorpe\'s associated \r        conference at MIT, September 2004.</span></p>\r    </div>\r    <p>&nbsp;</p>\r  </div>\r  <p>&nbsp;</p>\r  <p>&nbsp;</p>\r  <p>&nbsp;</p>\r  <p>&nbsp;</p>\r  <p>&nbsp;</p>\r</div>\r</body>\r</html>\r',
 'pid': 330,
 'url': 'http://www0.cs.ucl.ac.uk/research/vr/Projects/VLF/Media/escape/behavingtech.html'}